---
kind: other
id: Methods.T:Autodesk.Revit.DB.AnnotationSymbolType
source: html/35f707c4-1615-4a04-cc25-bbae7e612c71.htm
---
# AnnotationSymbolType Methods

Activates the symbol to ensure that its geometry is accessible.